Revit 2027 API
BuiltInFailures.GeneralFailures.ErrorResolved Property
 Error "[Text]" was automatically resolved by "[Resolution]"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ErrorResolved { get; }
Public Shared ReadOnly Property ErrorResolved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ErrorResolved {
	FailureDefinitionId^ get ();
}
static member ErrorResolved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace